"""
Задача 3. Следующее и предыдущее числа

Что нужно сделать

Напишите программу, которая получает от пользователя число и выводит на экран два ответа — следующее и предыдущее числа.
"""

num = int(input('Введите число: '))
print(num - 1, num, num + 1)
