"""
Задача 4. Площадь треугольника

Что нужно сделать

Напишите программу, которая запрашивает у пользователя длины двух катетов в прямоугольном треугольнике
 и выводит его площадь.
"""
s1 = int(input('Введите значение первого катета: '))
s2 = int(input('Введите значение второго катета: '))
print(f'Площадь треугольника равна {s1 * s2 / 2}')
